MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TFCDFL/mcu.h
/*
 * Generated MCU header wrapper for Renesas RX26T R5F526TFCDFL.
 * Register definitions are taken from the Renesas GNU iodefine.h supplied
 * with the RX family source package used by this generator.
 */
#ifndef MIKROE_R5F526TFCDFL_MCU_H
#define MIKROE_R5F526TFCDFL_MCU_H

#define MIKROE_MCU_RX26T 1
#define MIKROE_MCU_R5F526TFCDFL 1
#define MIKROE_MCU_PIN_COUNT 48
#define MIKROE_MCU_PACKAGE_LFQFP 1
#define MIKROE_MCU_ROM_SIZE_BYTES 524288UL
#define MIKROE_MCU_RAM_SIZE_BYTES 65536UL

/*
* Copyright (c) 2022(2023-2025) Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/********************************************************************************/
/*                                                                              */
/* Device     : RX/RX200/RX26T                                                  */
/* File Name  : iodefine.h                                                      */
/* Abstract   : Definition of I/O Register.                                     */
/* History    : V0.40  (2022-04-28)  [Hardware Manual Revision : 0.40]          */
/*            : V0.50  (2022-06-01)  [Hardware Manual Revision : 0.50]          */
/*            : V0.50A (2022-07-04)  [Hardware Manual Revision : 0.50]          */
/*            : V0.50B (2022-08-25)  [Hardware Manual Revision : 0.50]          */
/*            : V1.00  (2022-12-13)  [Hardware Manual Revision : 0.60]          */
/*            : V1.00A (2023-01-27)  [Hardware Manual Revision : 1.00]          */
/*            : V1.10  (2023-07-07)  [Hardware Manual Revision : 1.10]          */
/*            : V1.10A (2023-08-22)  [Hardware Manual Revision : 1.10]          */
/*            : V1.10B (2024-05-21)  [Hardware Manual Revision : 1.10]          */
/*            : V1.10C (2025-02-14)  [Hardware Manual Revision : 1.10]          */
/* Note       : This is a typical example.                                      */
/*                                                                              */
/********************************************************************************/
/*                                                                              */
/*  DESCRIPTION : Definition of ICU Register                                    */
/*  CPU TYPE    : RX26T                                                         */
/*                                                                              */
/*  Usage : IR,DTCER,IER,IPR of ICU Register                                    */
/*     The following IR, DTCE, IEN, IPR macro functions simplify usage.         */
/*     The bit access operation is "Bit_Name(interrupt source,name)".           */
/*     A part of the name can be omitted.                                       */
/*     for example :                                                            */
/*       IR(BSC,BUSERR) = 0;     expands to :                                   */
/*         ICU.IR[16].BIT.IR = 0;                                               */
/*                                                                              */
/*       DTCE(ICU,IRQ0) = 1;     expands to :                                   */
/*         ICU.DTCER[64].BIT.DTCE = 1;                                          */
/*                                                                              */
/*       IEN(CMT0,CMI0) = 1;     expands to :                                   */
/*         ICU.IER[0x03].BIT.IEN4 = 1;                                          */
/*                                                                              */
/*       IPR(ICU,SWINT2) = 2;    expands to :                                   */
/*       IPR(ICU,SWI   ) = 2;    // SWINT2,SWINT share IPR level.               */
/*         ICU.IPR[3].BIT.IPR = 2;                                              */
/*                                                                              */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)                      */
/*     The number of vector is "(interrupt source, name)".                      */
/*     for example :                                                            */
/*       #pragma interrupt INT_IRQ0(vect=VECT(ICU,IRQ0))          expands to :  */
/*         #pragma interrupt INT_IRQ0(vect=64)                                  */
/*       #pragma interrupt INT_CMT0_CMI0(vect=VECT(CMT0,CMI0))    expands to :  */
/*         #pragma interrupt INT_CMT0_CMI0(vect=28)                             */
/*                                                                              */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC of SYSTEM Register                          */
/*     The bit access operation is "MSTP(name)".                                */
/*     The name that can be used is a macro name defined with "iodefine.h".     */
/*     for example :                                                            */
/*       MSTP(TMR2) = 0;    // TMR2,TMR3,TMR23                    expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA4  = 0;                                      */
/*       MSTP(MTU4) = 0;    // MTU,MTU0,MTU1,MTU2,MTU3,MTU4,...   expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA9  = 0;                                      */
/*       MSTP(CMT3) = 0;    // CMT2,CMT3                          expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA14 = 0;                                      */
/*                                                                              */
/*                                                                              */
/********************************************************************************/
#ifndef __RX26TIODEFINE_HEADER__
#define __RX26TIODEFINE_HEADER__

#define	IEN_BSC_BUSERR		IEN0
#define	IEN_RAM_RAMERR		IEN2
#define	IEN_FCU_FIFERR		IEN5
#define	IEN_FCU_FRDYI		IEN7
#define	IEN_ICU_SWINT2		IEN2
#define	IEN_ICU_SWINT		IEN3
#define	IEN_CMT0_CMI0		IEN4
#define	IEN_CMT1_CMI1		IEN5
#define	IEN_CMT2_CMI2		IEN6
#define	IEN_CMT3_CMI3		IEN7
#define	IEN_RSPI0_SPRI0		IEN6
#define	IEN_RSPI0_SPTI0		IEN7
#define	IEN_RI3C0_RESPI		IEN0
#define	IEN_RI3C0_CMDI		IEN1
#define	IEN_RI3C0_IBII		IEN2
#define	IEN_RI3C0_RCVI		IEN3
#define	IEN_RSPIA0_SPRI		IEN0
#define	IEN_RSPIA0_SPTI		IEN1
#define	IEN_RIIC0_RXI0		IEN4
#define	IEN_RIIC0_TXI0		IEN5
#define	IEN_SCI1_RXI1		IEN4
#define	IEN_SCI1_TXI1		IEN5
#define	IEN_ICU_IRQ0		IEN0
#define	IEN_ICU_IRQ1		IEN1
#define	IEN_ICU_IRQ2		IEN2
#define	IEN_ICU_IRQ3		IEN3
#define	IEN_ICU_IRQ4		IEN4
#define	IEN_ICU_IRQ5		IEN5
#define	IEN_ICU_IRQ6		IEN6
#define	IEN_ICU_IRQ7		IEN7
#define	IEN_ICU_IRQ8		IEN0
#define	IEN_ICU_IRQ9		IEN1
#define	IEN_ICU_IRQ10		IEN2
#define	IEN_ICU_IRQ11		IEN3
#define	IEN_ICU_IRQ12		IEN4
#define	IEN_ICU_IRQ13		IEN5
#define	IEN_ICU_IRQ14		IEN6
#define	IEN_ICU_IRQ15		IEN7
#define	IEN_SCI5_RXI5		IEN4
#define	IEN_SCI5_TXI5		IEN5
#define	IEN_SCI6_RXI6		IEN6
#define	IEN_SCI6_TXI6		IEN7
#define	IEN_LVD1_LVD1		IEN0
#define	IEN_LVD2_LVD2		IEN1
#define	IEN_IWDT_IWUNI		IEN7
#define	IEN_WDT_WUNI		IEN0
#define	IEN_RSCI8_RXI		IEN4
#define	IEN_RSCI8_TXI		IEN5
#define	IEN_RSCI9_RXI		IEN6
#define	IEN_RSCI9_TXI		IEN7
#define	IEN_ICU_GROUPBL2	IEN3
#define	IEN_ICU_GROUPBL0	IEN6
#define	IEN_ICU_GROUPBL1	IEN7
#define	IEN_ICU_GROUPAL0	IEN0
#define	IEN_ICU_GROUPAL1	IEN1
#define	IEN_RSCI11_RXI		IEN2
#define	IEN_RSCI11_TXI		IEN3
#define	IEN_SCI12_RXI12		IEN4
#define	IEN_SCI12_TXI12		IEN5
#define	IEN_RI3C0_RXI		IEN6
#define	IEN_RI3C0_TXI		IEN7
#define	IEN_DMAC_DMAC0I		IEN0
#define	IEN_DMAC_DMAC1I		IEN1
#define	IEN_DMAC_DMAC2I		IEN2
#define	IEN_DMAC_DMAC3I		IEN3
#define	IEN_DMAC_DMAC74I	IEN4
#define	IEN_OST_OSTDI		IEN5
#define	IEN_S12AD_S12ADI	IEN0
#define	IEN_S12AD_S12GBADI	IEN1
#define	IEN_S12AD_S12GCADI	IEN2
#define	IEN_S12AD1_S12ADI1	IEN4
#define	IEN_S12AD1_S12GBADI1	IEN5
#define	IEN_S12AD1_S12GCADI1	IEN6
#define	IEN_S12AD2_S12ADI2	IEN0
#define	IEN_S12AD2_S12GBADI2	IEN1
#define	IEN_S12AD2_S12GCADI2	IEN2
#define	IEN_CANFD_RFDREQ0	IEN4
#define	IEN_CANFD_RFDREQ1	IEN5
#define	IEN_CANFD0_CFDREQ0	IEN6
#define	IEN_TMR0_CMIA0		IEN2
#define	IEN_TMR0_CMIB0		IEN3
#define	IEN_TMR0_OVI0		IEN4
#define	IEN_TMR1_CMIA1		IEN5
#define	IEN_TMR1_CMIB1		IEN6
#define	IEN_TMR1_OVI1		IEN7
#define	IEN_TMR2_CMIA2		IEN0
#define	IEN_TMR2_CMIB2		IEN1
#define	IEN_TMR2_OVI2		IEN2
#define	IEN_TMR3_CMIA3		IEN3
#define	IEN_TMR3_CMIB3		IEN4
#define	IEN_TMR3_OVI3		IEN5
#define	IEN_TMR4_CMIA4		IEN6
#define	IEN_TMR4_CMIB4		IEN7
#define	IEN_TMR4_OVI4		IEN0
#define	IEN_TMR5_CMIA5		IEN1
#define	IEN_TMR5_CMIB5		IEN2
#define	IEN_TMR5_OVI5		IEN3
#define	IEN_TMR6_CMIA6		IEN4
#define	IEN_TMR6_CMIB6		IEN5
#define	IEN_TMR6_OVI6		IEN6
#define	IEN_TMR7_CMIA7		IEN7
#define	IEN_TMR7_CMIB7		IEN0
#define	IEN_TMR7_OVI7		IEN1
#define	IEN_ELC_ELSR18I		IEN7
#define	IEN_ELC_ELSR19I		IEN0
#define	IEN_TSIP_RD			IEN1
#define	IEN_TSIP_WR			IEN2
#define	IEN_TSIP_ERR		IEN3
#define	IEN_CMPC0_CMPC0		IEN4
#define	IEN_CMPC1_CMPC1		IEN5
#define	IEN_CMPC2_CMPC2		IEN6
#define	IEN_CMPC3_CMPC3		IEN7
#define	IEN_CMPC4_CMPC4		IEN0
#define	IEN_CMPC5_CMPC5		IEN1
#define	IEN_CMTW0_CMWI0		IEN2
#define	IEN_CMTW0_IC0I0		IEN3
#define	IEN_CMTW0_IC1I0		IEN4
#define	IEN_CMTW0_OC0I0		IEN5
#define	IEN_CMTW0_OC1I0		IEN6
#define	IEN_CMTW1_CMWI1		IEN7
#define	IEN_CMTW1_IC0I1		IEN0
#define	IEN_CMTW1_IC1I1		IEN1
#define	IEN_CMTW1_OC0I1		IEN2
#define	IEN_CMTW1_OC1I1		IEN3
#define	IEN_RSCI9_AED		IEN5
#define	IEN_PERIA_INTA208	IEN0
#define	IEN_PERIA_INTA209	IEN1
#define	IEN_PERIA_INTA210	IEN2
#define	IEN_PERIA_INTA211	IEN3
#define	IEN_PERIA_INTA212	IEN4
#define	IEN_PERIA_INTA213	IEN5
#define	IEN_PERIA_INTA214	IEN6
#define	IEN_PERIA_INTA215	IEN7
#define	IEN_PERIA_INTA216	IEN0
#define	IEN_PERIA_INTA217	IEN1
#define	IEN_PERIA_INTA218	IEN2
#define	IEN_PERIA_INTA219	IEN3
#define	IEN_PERIA_INTA220	IEN4
#define	IEN_PERIA_INTA221	IEN5
#define	IEN_PERIA_INTA222	IEN6
#define	IEN_PERIA_INTA223	IEN7
#define	IEN_PERIA_INTA224	IEN0
#define	IEN_PERIA_INTA225	IEN1
#define	IEN_PERIA_INTA226	IEN2
#define	IEN_PERIA_INTA227	IEN3
#define	IEN_PERIA_INTA228	IEN4
#define	IEN_PERIA_INTA229	IEN5
#define	IEN_PERIA_INTA230	IEN6
#define	IEN_PERIA_INTA231	IEN7
#define	IEN_PERIA_INTA232	IEN0
#define	IEN_PERIA_INTA233	IEN1
#define	IEN_PERIA_INTA234	IEN2
#define	IEN_PERIA_INTA235	IEN3
#define	IEN_PERIA_INTA236	IEN4
#define	IEN_PERIA_INTA237	IEN5
#define	IEN_PERIA_INTA238	IEN6
#define	IEN_PERIA_INTA239	IEN7
#define	IEN_PERIA_INTA240	IEN0
#define	IEN_PERIA_INTA241	IEN1
#define	IEN_PERIA_INTA242	IEN2
#define	IEN_PERIA_INTA243	IEN3
#define	IEN_PERIA_INTA244	IEN4
#define	IEN_PERIA_INTA245	IEN5
#define	IEN_PERIA_INTA246	IEN6
#define	IEN_PERIA_INTA247	IEN7
#define	IEN_PERIA_INTA248	IEN0
#define	IEN_PERIA_INTA249	IEN1
#define	IEN_PERIA_INTA250	IEN2
#define	IEN_PERIA_INTA251	IEN3
#define	IEN_PERIA_INTA252	IEN4
#define	IEN_PERIA_INTA253	IEN5
#define	IEN_PERIA_INTA254	IEN6
#define	IEN_PERIA_INTA255	IEN7

#define	VECT_BSC_BUSERR		16
#define	VECT_RAM_RAMERR		18
#define	VECT_FCU_FIFERR		21
#define	VECT_FCU_FRDYI		23
#define	VECT_ICU_SWINT2		26
#define	VECT_ICU_SWINT		27
#define	VECT_CMT0_CMI0		28
#define	VECT_CMT1_CMI1		29
#define	VECT_CMT2_CMI2		30
#define	VECT_CMT3_CMI3		31
#define	VECT_RSPI0_SPRI0	38
#define	VECT_RSPI0_SPTI0	39
#define	VECT_RI3C0_RESPI	40
#define	VECT_RI3C0_CMDI		41
#define	VECT_RI3C0_IBII		42
#define	VECT_RI3C0_RCVI		43
#define	VECT_RSPIA0_SPRI	48
#define	VECT_RSPIA0_SPTI	49
#define	VECT_RIIC0_RXI0		52
#define	VECT_RIIC0_TXI0		53
#define	VECT_SCI1_RXI1		60
#define	VECT_SCI1_TXI1		61
#define	VECT_ICU_IRQ0		64
#define	VECT_ICU_IRQ1		65
#define	VECT_ICU_IRQ2		66
#define	VECT_ICU_IRQ3		67
#define	VECT_ICU_IRQ4		68
#define	VECT_ICU_IRQ5		69
#define	VECT_ICU_IRQ6		70
#define	VECT_ICU_IRQ7		71
#define	VECT_ICU_IRQ8		72
#define	VECT_ICU_IRQ9		73
#define	VECT_ICU_IRQ10		74
#define	VECT_ICU_IRQ11		75
#define	VECT_ICU_IRQ12		76
#define	VECT_ICU_IRQ13		77
#define	VECT_ICU_IRQ14		78
#define	VECT_ICU_IRQ15		79
#define	VECT_SCI5_RXI5		84
#define	VECT_SCI5_TXI5		85
#define	VECT_SCI6_RXI6		86
#define	VECT_SCI6_TXI6		87
#define	VECT_LVD1_LVD1		88
#define	VECT_LVD2_LVD2		89
#define	VECT_IWDT_IWUNI		95
#define	VECT_WDT_WUNI		96
#define	VECT_RSCI8_RXI		100
#define	VECT_RSCI8_TXI		101
#define	VECT_RSCI9_RXI		102
#define	VECT_RSCI9_TXI		103
#define	VECT_ICU_GROUPBL2	107
#define	VECT_ICU_GROUPBL0	110
#define	VECT_ICU_GROUPBL1	111
#define	VECT_ICU_GROUPAL0	112
#define	VECT_ICU_GROUPAL1	113
#define	VECT_RSCI11_RXI		114
#define	VECT_RSCI11_TXI		115
#define	VECT_SCI12_RXI12	116
#define	VECT_SCI12_TXI12	117
#define	VECT_RI3C0_RXI		118
#define	VECT_RI3C0_TXI		119
#define	VECT_DMAC_DMAC0I	120
#define	VECT_DMAC_DMAC1I	121
#define	VECT_DMAC_DMAC2I	122
#define	VECT_DMAC_DMAC3I	123
#define	VECT_DMAC_DMAC74I	124
#define	VECT_OST_OSTDI		125
#define	VECT_S12AD_S12ADI	128
#define	VECT_S12AD_S12GBADI	129
#define	VECT_S12AD_S12GCADI	130
#define	VECT_S12AD1_S12ADI1	132
#define	VECT_S12AD1_S12GBADI1	133
#define	VECT_S12AD1_S12GCADI1	134
#define	VECT_S12AD2_S12ADI2	136
#define	VECT_S12AD2_S12GBADI2	137
#define	VECT_S12AD2_S12GCADI2	138
#define	VECT_CANFD_RFDREQ0	140
#define	VECT_CANFD_RFDREQ1	141
#define	VECT_CANFD0_CFDREQ0	142
#define	VECT_TMR0_CMIA0		146
#define	VECT_TMR0_CMIB0		147
#define	VECT_TMR0_OVI0		148
#define	VECT_TMR1_CMIA1		149
#define	VECT_TMR1_CMIB1		150
#define	VECT_TMR1_OVI1		151
#define	VECT_TMR2_CMIA2		152
#define	VECT_TMR2_CMIB2		153
#define	VECT_TMR2_OVI2		154
#define	VECT_TMR3_CMIA3		155
#define	VECT_TMR3_CMIB3		156
#define	VECT_TMR3_OVI3		157
#define	VECT_TMR4_CMIA4		158
#define	VECT_TMR4_CMIB4		159
#define	VECT_TMR4_OVI4		160
#define	VECT_TMR5_CMIA5		161
#define	VECT_TMR5_CMIB5		162
#define	VECT_TMR5_OVI5		163
#define	VECT_TMR6_CMIA6		164
#define	VECT_TMR6_CMIB6		165
#define	VECT_TMR6_OVI6		166
#define	VECT_TMR7_CMIA7		167
#define	VECT_TMR7_CMIB7		168
#define	VECT_TMR7_OVI7		169
#define	VECT_ELC_ELSR18I	175
#define	VECT_ELC_ELSR19I	176
#define	VECT_TSIP_RD		177
#define	VECT_TSIP_WR		178
#define	VECT_TSIP_ERR		179
#define	VECT_CMPC0_CMPC0	180
#define	VECT_CMPC1_CMPC1	181
#define	VECT_CMPC2_CMPC2	182
#define	VECT_CMPC3_CMPC3	183
#define	VECT_CMPC4_CMPC4	184
#define	VECT_CMPC5_CMPC5	185
#define	VECT_CMTW0_CMWI0	186
#define	VECT_CMTW0_IC0I0	187
#define	VECT_CMTW0_IC1I0	188
#define	VECT_CMTW0_OC0I0	189
#define	VECT_CMTW0_OC1I0	190
#define	VECT_CMTW1_CMWI1	191
#define	VECT_CMTW1_IC0I1	192
#define	VECT_CMTW1_IC1I1	193
#define	VECT_CMTW1_OC0I1	194
#define	VECT_CMTW1_OC1I1	195
#define	VECT_RSCI9_AED		197
#define	VECT_PERIA_INTA208	208
#define	VECT_PERIA_INTA209	209
#define	VECT_PERIA_INTA210	210
#define	VECT_PERIA_INTA211	211
#define	VECT_PERIA_INTA212	212
#define	VECT_PERIA_INTA213	213
#define	VECT_PERIA_INTA214	214
#define	VECT_PERIA_INTA215	215
#define	VECT_PERIA_INTA216	216
#define	VECT_PERIA_INTA217	217
#define	VECT_PERIA_INTA218	218
#define	VECT_PERIA_INTA219	219
#define	VECT_PERIA_INTA220	220
#define	VECT_PERIA_INTA221	221
#define	VECT_PERIA_INTA222	222
#define	VECT_PERIA_INTA223	223
#define	VECT_PERIA_INTA224	224
#define	VECT_PERIA_INTA225	225
#define	VECT_PERIA_INTA226	226
#define	VECT_PERIA_INTA227	227
#define	VECT_PERIA_INTA228	228
#define	VECT_PERIA_INTA229	229
#define	VECT_PERIA_INTA230	230
#define	VECT_PERIA_INTA231	231
#define	VECT_PERIA_INTA232	232
#define	VECT_PERIA_INTA233	233
#define	VECT_PERIA_INTA234	234
#define	VECT_PERIA_INTA235	235
#define	VECT_PERIA_INTA236	236
#define	VECT_PERIA_INTA237	237
#define	VECT_PERIA_INTA238	238
#define	VECT_PERIA_INTA239	239
#define	VECT_PERIA_INTA240	240
#define	VECT_PERIA_INTA241	241
#define	VECT_PERIA_INTA242	242
#define	VECT_PERIA_INTA243	243
#define	VECT_PERIA_INTA244	244
#define	VECT_PERIA_INTA245	245
#define	VECT_PERIA_INTA246	246
#define	VECT_PERIA_INTA247	247
#define	VECT_PERIA_INTA248	248
#define	VECT_PERIA_INTA249	249
#define	VECT_PERIA_INTA250	250
#define	VECT_PERIA_INTA251	251
#define	VECT_PERIA_INTA252	252
#define	VECT_PERIA_INTA253	253
#define	VECT_PERIA_INTA254	254
#define	VECT_PERIA_INTA255	255

